УНФ_ТЕСТ/src/Enums/ТипыДействийРабочегоПроцесса/ТипыДействийРабочегоПроцесса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДействийРабочегоПроцесса</name>
  <enumValues>
    <name>ОтправитьEmail</name>
  </enumValues>
  <enumValues>
    <name>ОтправитьSMS</name>
  </enumValues>
  <enumValues>
    <name>СоздатьСобытие</name>
  </enumValues>
  <enumValues>
    <name>СоздатьЗаданиеНаРаботу</name>
  </enumValues>
  <enumValues>
    <name>СоздатьЗаписьКалендаря</name>
  </enumValues>
  <enumValues>
    <name>СоздатьНапоминание</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Enums/ТипыДействийРабочегоПроцесса/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СоответствиеДействийМодулямОбработчиков() Экспорт
	
	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить(
		Перечисления.ТипыДействийРабочегоПроцесса.ОтправитьEmail,
		Документы.Событие
	);
	
	Соответствие.Вставить(
		Перечисления.ТипыДействийРабочегоПроцесса.ОтправитьSMS,
		Документы.Событие
	);
	
	Соответствие.Вставить(
		Перечисления.ТипыДействийРабочегоПроцесса.СоздатьСобытие,
		Документы.Событие
	);
	
	Соответствие.Вставить(
		Перечисления.ТипыДействийРабочегоПроцесса.СоздатьЗаданиеНаРаботу,
		Документы.ЗаданиеНаРаботу
	);
	
	Соответствие.Вставить(
		Перечисления.ТипыДействийРабочегоПроцесса.СоздатьЗаписьКалендаря,
		Справочники.ЗаписиКалендаряСотрудника
	);
	
	Соответствие.Вставить(
		Перечисления.ТипыДействийРабочегоПроцесса.СоздатьНапоминание,
		ОбщегоНазначения.ОбщийМодуль("ОбсужденияУНФ")
	);
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти

#КонецЕсли
